Revit 2027 API
Area.IsGrossInterior Property
The boolean value that indicates whether the area is gross interior.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsGrossInterior { get; }
Public ReadOnly Property IsGrossInterior As Boolean
	Get
public:
property bool IsGrossInterior {
	bool get ();
}
member IsGrossInterior : bool with get
Property Value
Boolean
See Also
Reference
Area Class
Autodesk.Revit.DB Namespace